Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: དེ་དག་གི་འདོད་པ་ལ་དགའ་བ་དང་། འདོད་པ་ལ་སྲེད་པ་དང་། འདོད་པ་ལ་འདུན་པ་དང་། འདོད་པ་ལ་བརྐམ་པ་དང་། འདོད་པ་ལ་ཡོངས་སུ་གདུང་བ་དང་། འདོད་པ་ལ་བརྒྱལ་བ་དང་། འདོད་པ་ལ་ཞེན་པ་གང་ཡིན་པ་དེ་ནི་ཉེ་བར་ཞི་བ་མ་ཡིན་གྱི།
en: They delight in those objects and feel attached to them, long for them, wish for them, strive for them, crave and thirst for them, become senseless for them, and are burned by them. This striving after the objects of desire never brings peace.

source: དེ་དག་བདག་ཉིད་ཀྱིས་གནོད་པར་བྱེད་ཅིང་། ལུས་ལ་གདུང་བར་བྱེད་པས། སྡུག་བསྔལ་གྱི་ཚོར་བ་དྲག་པོ་མི་བཟད་པ་ཚ་བ་མྱོང་མོད་ཀྱི་འོན་ཀྱང་དེ་དག་མིའི་ཆོས་བླ་མ་ལས་མཆོག་ཏུ་གྱུར་པ་འཕགས་པ་ཡེ་ཤེས་མཐོང་བའི་ཁྱད་པར་མངོན་དུ་བྱེད་མི་ནུས་སོ་སྙམ་སྟེ། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ལ་དཔེ་མངོན་དུ་གྱུར་པ་དང་པོའོ།
en: They further harm themselves and torment their bodies and end up with intense and unbearable feelings of suffering. Therefore, in doing so, they become incapable of actualizing the noble wisdom vision that is superior to any human teaching.” This was the first example that he had never thought or heard of that came to the Bodhisattva’s mind.

source: །ཡང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། གང་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་འདི་དག་འདོད་པ་རྣམས་ལས་ལུས་དང་སེམས་དབེན་པར་གནས་ཀྱང་།
en: Second, he continued to think, “There are also monks and priests who have separated their mind and body from the objects of their desire.

source: དེ་དག་གི་འདོད་པ་ལ་དགའ་བ་ཞེས་བྱ་བ་ནས་མེ་ཚོལ་བ་ཞེས་བྱ་བའི་བར་དུ་ཐམས་ཅད་སྔ་མ་བཞིན་དུ་སྦྱར་ཏེ། དེས་ཤིང་རློན་པའི་གཙུབ་སྟན་ཐོགས་ལ་ཐང་ལ་བཞག་སྟེ། ཤིང་རློན་པའི་གཙུབ་ཤིང་གིས་གཙུབས་ན་དེས་མེ་ཕྱིན་པར་མི་ནུས་སོ། །
en: This is like a person who tries in vain to create a fire in order to make light by placing a wet piece of wood on the ground and rubbing another wet piece of wood against it. He will be unable to produce fire and make light.

source: དེ་བཞིན་དུ་གང་དགེ་སྦྱོང་དང་བྲམ་ཟེ་འདི་དག་ཅེས་བྱ་བ་ནས་ཐམས་ཅད་སྔ་མ་བཞིན་དུ་སྦྱར་ཏེ། མིའི་ཆོས་བླ་མ་ལས་མཆོག་ཏུ་གྱུར་པ་འཕགས་པ་ཡེ་ཤེས་མཐོང་བའི་ཁྱད་པར་མངོན་དུ་བྱ་བར་མི་ནུས་སོ་སྙམ་སྟེ།
en: Therefore, in doing so, they become incapable of actualizing the noble wisdom vision that is much supreme to the highest human teaching.”

source: འདི་ནི་སྔོན་མ་ཐོས་ཤིང་མི་ཤེས་པའི་དཔེ་མངོན་དུ་གྱུར་པ་གཉིས་པའོ། །
en: This was the second example that he had never thought or heard of that came to the Bodhisattva’s mind.

source: གཞན་ཡང་གང་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་འདི་དག་འདོད་པ་རྣམས་ལས་ལུས་དང་སེམས་དབེན་པར་གནས་ཤིང་།
en: Third, he thought, “There are also other monks and priests who have separated their mind and body from the objects of their desire.

source: དེ་དག་གི་འདོད་པ་ལ་དགའ་བ་ཞེས་བྱ་བ་ནས། ཐམས་ཅད་དེ་བཞིན་དུ་སྦྱར་ཏེ་དེ་དག་གི་དེ་ནི་ཉེ་བར་ཞི་བ་ཡིན་ཏེ། དེ་དག་བདག་ཉིད་ཀྱིས་གནོད་པ་བྱེད་ཅིང་ལུས་ལ་གདུང་བར་བྱེད་པས་སྡུག་བསྔལ་གྱི་ཚོར་བ་དྲག་པོ་མི་བཟད་པ་མྱོང་མོད་ཀྱི་འོན་ཀྱང་དེ་དག་མིའི་ཆོས་བླ་མ་ལས་མཆོག་ཏུ་གྱུར་པ། འཕགས་པ་ཡེ་ཤེས་མངོན་དུ་མཐོང་བའི་ཁྱད་པར་མངོན་དུ་བྱ་བར་ནུས་སོ།
en: Although they also delight in those objects and feel attached to them, long for them, wish for them, strive for them, crave and thirst for them, and become senseless for them, they do find peace. Although they do harm themselves and torment their bodies and end up with intense and unbearable feelings of suffering, in doing so they do become capable of actualizing the noble wisdom vision that is superior to human teaching.

source: །འདི་ལྟ་སྟེ་དཔེར་ན་སྐྱེ་བུ་ཞིག་མེ་འདོད་ཅིང་འོད་འདོད་པ་དང་། འོད་ཚོལ་བར་གྱུར་ལ། དེས་ཤིང་སྐམ་པོའི་གཙུབ་སྟན་དང་། གཙུབ་ཤིང་ཐོགས་ཤིང་ཐང་ལ་བཞག་སྟེ་གཙུབས་ན། དེས་མེ་དབྱུང་བ་དང་འོད་འབར་བར་བྱེད་ནུས་སོ། །
en: They are like a person who wishes to create a fire in order to make light, and therefore places a dry piece of wood on the ground and rubs another dry piece of wood against it. For such a person the fire will ignite, and light will shine.

source: །དགེ་སློང་དག་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་ཀྱང་ད་ལྟར་འདོད་པ་རྣམས་ལས་ལུས་དབེན་པར་གནས། འདོད་པ་རྣམས་ལས་སེམས་དབེན་པར་གནས་ལ། བདག་གི་འདོད་པ་ལ་དགའ་བ་ཞེས་བྱ་བ་ནས་ཐམས་ཅད་སྔ་མ་བཞིན་དུ་སྦྱར་ཏེ། བདག་གི་དེ་ཡང་ཉེ་བར་ཞི་བ་ཡིན་ལ་བདག་ཉིད་ཀྱིས་གནོད་པར་བྱས་ཤིང་ལུས་ལ་གདུང་བར་བྱེད་པས་སྡུག་བསྔལ་ཞེས་བྱ་བ་ནས་ཚོར་བ་མྱོང་ཞེས་བྱ་བའི་བར་དུ་སྔ་མ་བཞིན་དུ་སྦྱར་ཏེ། འོན་ཀྱང་བདག་མིའི་ཆོས་བླ་མ་ལས་མཆོག་ཏུ་གྱུར་པ་འཕགས་པ་ཡེ་ཤེས་མཐོང་བའི་ཁྱད་པར་མངོན་དུ་བྱ་བར་ནུས་སོ་སྙམ་མོ།
en: Monks, then the Bodhisattva thought to himself, “I have also separated my body from the objects of desire. Although I also delight in those objects and feel attached to them, long for them, wish for them, strive for them, crave and thirst for them, and become senseless for them, I do nevertheless find peace. Although I do harm myself and torment my body and end up with intense and unbearable feelings of suffering, as if being burned, in doing so I have become capable of actualizing the noble wisdom vision that is much supreme to the highest human teaching.”

source: །དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཇི་སྲིད་དགའ་བའི་བར་དུ་ག་ཡཱའི་རིར་ག་ཡཱའི་རྩེ་མོ་ལ་གནས་ཏེ། རྐང་གིས་ཡུལ་རྒྱུ་ཞིང་སྡེ་དཔོན་གྱི་གྲོང་ལྟེང་རྒྱས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། དེ་ན་ཀླུང་ནཻ་རན་ཛ་ན་ཆུ་གསལ་བ་འབབ་སྟེགས་བདེ་བ། ཤིང་དང་ཤིང་གེལ་པ་མཛེས་པ་དག་གིས་བརྒྱན་པ་ཉེ་འཁོར་ན་སྤྱོད་ཡུལ་གྱི་གྲོང་ཡོད་པ་མཐོང་སྟེ།
en: Monks, in this way the Bodhisattva remained in Gayā at the peak of Mount Gayā for as long as he pleased before he proceeded by foot to the village Senāpati near Urubilvā. On the way he passed by the Nairañjanā River. He witnessed its pure water and beautiful bathing areas and saw how trees and groves adorned the riverbank and the surrounding village.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཡིད་ཤིན་ཏུ་དགའ་བར་གྱུར་ནས་འདི་སྙམ་དུ་སེམས་ཏེ། ཨེ་མའོ་ས་ཕྱོགས་འདི་ནི་མཉམ་ཤིང་ཉམས་དགའ་བ། ནང་དུ་ཡང་དག་འཇོག་དང་འཐུན་པ་སྟེ། རིགས་ཀྱི་བུ་སྤོང་བ་དོན་དུ་གཉེར་བ་ལ་ནི་འདིས་ཆོག་གོ། །
en: This made the Bodhisattva very delighted, and he thought to himself, “What an amazing place! It is so pleasant! It is a great place to stay, and it is perfect for someone of noble family who is wholly dedicated to renunciation.

source: བདག་ཀྱང་སྤོང་བ་དོན་དུ་གཉེར་བ་ཡིན་གྱིས་བདག་འདི་ཉིད་དུ་གནས་པར་བྱའོ་སྙམ་མོ།
en: Since I am wholly dedicated to renunciation, I will stay here.”

source: །དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་ནི་འཛམ་བུའི་གླིང་འདིར་སྙིགས་མ་ལྔའི་དུས་ལ་བབ་ཅིང་སེམས་ཅན་རྣམས་དམན་པ་ལ་མོས་པ་དང་། མུ་སྟེགས་ཅན་གྱི་སྡེས་གང་བ་དང་། ལྟ་བ་སྣ་ཚོགས་ལ་ཞུགས་པ་དང་། ལུས་ལ་རིལ་པོར་འཛིན་པ་ལ་ཞེན་པའི་ཚེ་འོངས་ཏེ།
en: Monks, the Bodhisattva continued to think, “I have been born in this world at the time of the five degenerations among beings who are occupied with lowly pursuits. These various religious practitioners have so many orientations and views. They wholly fixate on the body.

source: བླུན་པོ་དག་གདུང་བས་ཡོངས་སུ་གདུང་བ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་དག་པ་ཚོལ་ཞིང་སྟོན་པ་འདི་ལྟ་སྟེ། སྔགས་སྤྱོད་པ་དང་ལག་པ་ལ་ལྡག་པ་དང་། མི་སློང་བ་དང་། མི་སྨྲ་བ་དང་། རྩ་བ་དུ་མ་ཟ་བ་དང་། ཤ་དང་ཉ་མི་ཟ་བ་དང་། དབྱར་མི་འབྱུང་བ་དང་། ཆང་དང་། ཕུབ་མ་དང་། ཆུ་ཡོངས་སུ་སྤངས་པ་དང་། ཁྱིམ་གཅིག་དང་། གསུམ་དང་། ལྔ་དང་བདུན་ནས་ཟས་ལེན་པ་དང་། རྩ་བ་དང་། འབྲས་བུ་དང་། ཉ་ལྕིབས་དང་། རྩྭ་ཀུ་ཤ་དང་། ལོ་མ་དང་། བ་ལང་གི་ལྕི་བ་དང་། བའི་གཅིན་དང་། འོ་ཐུག་དང་། ཞོ་དང་། མར་དང་། བུ་རམ་དང་། མ་བརྟགས་པ་ཟ་ཞིང་འཐུང་བ་དང་། བྱ་ངང་པ་དང་། ཕུག་རོན་གྱིས་ཟོས་ཏེ་བོར་བ་བཀྲུས་ཏེ་ཟ་བ་དང་། གྲོང་དང་དགོན་པས་འཚོ་བ་དང་། བ་ལང་གི་བརྟུལ་ཞུགས་དང་། རི་དགས་དང་། ཁྱི་དང་། ཕག་དང་། སྤྲེའུ་དང་། གླང་པོ་ཆེའི་བརྟུལ་ཞུགས་དང་། འགྲེང་བ་དང་། མི་སྨྲ་བ་དང་། དཔའ་བོའི་ཚུལ་དུ་འདུག་པ་དང་། ཁམ་གཅིག་ཟ་བ་དང་། ཁམ་བདུན་གྱི་བར་དུ་ཟ་བ་དང་། ཟས་ལན་གཅིག་ཟ་བ་དང་། ཉིན་ཞག་གཅིག་ཟ་བ་དང་། བཞི་དང་ལྔ་དང་དྲུག་གི་སྐབས་སྐབས་སུ་ཟ་བ་དང་། ཟླ་བ་ཕྱེད་དང་། ཟླ་བ་གཅིག་ཟ་བར་བྱེད་པ་དང་། ཟླ་བ་ལ་ལྟ་བ་དང་།
en: They seek to purify the body by oppressing it in various ways. In complete ignorance, they give instructions. Some, for example, make use of spells, lick their hands, remain seated, cease talking, ingest various roots, abstain from eating meat and fish, spend the summer indoors, refrain from wine and beverages and even water, and take their nourishment from one or three or five or seven houses. “Some consume roots, fruits, water plants, kuśa grass, leaves, cow dung, cow urine, milk, yogurt, butter, molasses, or seeds that have not been ground. There are others who wash and eat the leftovers that swans and pigeons throw away. Others live in villages or remote places. There are others who practice living like an ox, a deer, a dog, a pig, a monkey, or an elephant. There are some who only stand, some who don’t talk, and some who hold the vīrāsana body posture. Some live on just one mouthful of food, or anything up to seven mouthfuls. Some eat only once a day, some eat once every twenty-four hours, while others eat every four or five or six days. Others fast for a fortnight or a month, according to the moon.

source: བྱ་རྒོད་དང་། འུག་པའི་གཤོག་པ་ཐོགས་པ་དང་། ཤིང་ལེབ་དང་། རྩྭ་མུན་ཛ་དང་། ཟར་མའི་ཤུན་པ་དང་། རྩྭ་དཱུར་བ་དང་། གྲེས་མ་དང་། རྔ་བལ་གྱི་ལ་བ་དང་། ར་བལ་གྱི་ལ་བ་དང་། སྐྲའི་ལ་བ་དང་། ཀོ་ལྤགས་གྱོན་པ་དང་། གོས་གཤེར་བ་དང་། སྟེགས་བུའི་སྟེང་དང་། ཆུའི་ནང་ན་ཉལ་བ་དང་། ཐལ་བ་དང་། རྡོ་དང་། གྱོ་མོ་དང་། ཤིང་ལེབ་དང་། ཚེར་མ་དང་། རྩྭ་དང་། གཏུན་ཤིང་གི་སྟེང་དུ་ཉལ་བ་དང་། མགོ་ཐུར་དུ་བསྟན་པ་དང་། ཙོག་ཙོག་པོར་འདུག་པ་དང་། ཐང་ལ་ཉལ་བ་དང་། གོས་གཅིག་དང་། གོས་གཉིས་དང་། གསུམ་དང་བཞི་དང་། ལྔ་དང་། དྲུག་དང་། བདུན་དང་། གོས་མང་པོ་སྲེལ་བ་དང་། གཅེར་བུར་འདུག་པ་དང་། འཁྲུ་བ་དང་། མི་འཁྲུ་བའི་ཆོ་ག་ཅན་དང་། སྐྲ་དང་། སེན་མོ་དང་། ཨག་ཙོམ་རིང་པོར་འཇོག་པ་དང་། རལ་པའི་ཐོར་ཚུགས་འཆང་བ་དང་། རྒྱ་ཤུག་དང་། ཏིལ་དང་། འབྲས་འབྲུ་གཅིག་ཟ་བ་དང་། ཐལ་བ་དང་། སྣག་ཙ་དང་། མེ་ཏོག་སྤྱད་སྤྱད་པ་དང་རྡུལ་འཐུལ་བ་དང་། རྡུལ་ནག་པོ་དང་། ཕྱག་དར་དང་། རྫབ་ཀྱིས་ལུས་ལ་སྐུད་པ་དང་། བ་སྤུ་དང་། མིའི་ཐོད་པ་དང་། སྐྲ་དང་། སེན་མོ་དང་། ཚལ་བུའི་སྨད་གཡོགས་དང་། རྫབ་དང་། ཀེང་རུས་ཐོགས་པ་དང་། ཆུ་དྲོན་པོ་དང་། འབྲས་ཀྱི་ཁུ་བ་ལ་བར་བཙགས་པ་དང་། ཁྲུད་མ་འཐུང་བ་དང་། མདག་མ་དང་། ཚོན་རྩི་དང་། གོས་ངུར་སྨྲིག་དང་། ཁར་བ་གསུམ་དང་། མགོ་འདྲེག་པ་དང་། རིལ་བ་དང་། མིའི་ཐོད་པ་དང་། ཁྲིའི་ཟུར་ཤིང་འཆང་བས་བླུན་པོ་རྣམས་དག་པར་ཁོང་དུ་ཆུད་དོ། །
en: “Some dress themselves in the feathers of vultures or owls, while others wear planks, muñja grass, asana bark, darbha grass, or valvaja grass. Others don a cloak made of camel wool, goat wool, horsehair, or simply a hide. Still others only put on wet clothes. Some sleep on a stool or in the water, while others sleep in ashes, on rocks, gravel, planks, thorns, grass, or sticks. Others sleep with their heads toward the ground, in squatting posture, or on the bare ground. There are some who wear one, two, three, four, five, six, seven or more pieces of clothing, while others go naked. There are some who have a ritual of bathing, and others who make a ritual out of never bathing. Some let their hair and nails and beards grow long, while others keep their hair braided in a topknot. There are also some who subsist on just a single juniper berry, sesame seed, or grain of rice. “Some smear their bodies with ashes, soot, dead flower pollen, coal dust, dirt, and mud. Others adorn themselves with bodily hair, reeds, scalp hair, fingernails, rags, ribs, and skulls. They drink hot water, water leftover after washing rice, water filtered through a blanket, and dishwater. Some wear dyes of charcoal, minerals, or saffron, shave their heads, carry vases, human skulls, and clubs. “In such ways do these fools believe themselves to be pure.

source: དུ་བ་རྔུབ་པ་དང་། མེ་རྔུབ་པ་དང་། ཉི་མ་ལ་ལྟ་བ་དང་། གདུང་བ་ལྔ་བྱེད་པ་དང་། རྐང་པ་གཅིག་དང་། ལག་པ་གཅིག་བསྟོད་པ་དང་། རྐང་པ་གཅིག་བཙུགས་པ་དང་། གནས་གཅིག་ན་འདུག་པས་དཀའ་ཐུབ་ལ་སོགས་པ་དང་། ཕུབ་མ་ལ་སོགས་པ་དང་། མདག་མ་བསྲེགས་པ་དང་། བུམ་པ་བསྲེགས་པ་དང་། རྡོ་བསྲེགས་པ་དང་། མེ་འབར་བར་འཇུག་པ་དང་། ཟས་མི་ཟ་བ་དང་། མྱ་ངན་དང་། འབབ་སྟེགས་སུ་སོང་སྟེ་ཤི་བས་སྡུག་པའི་འགྲོ་བ་ཚོལ་ལོ། །རབ་བསྔགས་ཞེས་བྱ་བ་དང་། གཞི་མི་འགྲིབ་པ་ཞེས་བྱ་བ་དང་། གཞི་སྲུང་ཞེས་བྱ་བ་དང་། གཞི་ཚུགས་ཞེས་བྱ་བ་དང་། སྨོན་ལམ་དང་། བསྟོད་པ་དང་། སྦྱིན་སྲེག་དང་། དབབ་པ་དང་། སྔགས་ཀྱི་བཟླས་བརྗོད་དང་། ཀླག་པ་འཛིན་ཅིང་བྱེད་པས་དག་པར་ཁོང་དུ་ཆུད་དོ།
en: Some inhale smoke and fire, stare at the sun, and perform the five-fires ritual. They stand on one foot, raise one hand in the air, and stay in just one spot. Such are the hardships that they undergo. They use burning chaff and coals and tandoor ovens. They walk on glowing rocks, scorching fire, or scalding water. Some go to a sacred riverbank and die there.

source: །བདག་དག་པར་སེམས་ཤིང་དེ་དག་ལ་རྟེན་ཏེ། འདི་ལྟ་སྟེ་ཚངས་པ་དང་། དབང་པོ་དང་། གུ་ལང་དང་། ཁྱབ་འཇུག་དང་། ལྷ་མོ་དང་། གཞོན་ནུ་དང་། མ་མོ་དང་། ཀ་ཏྱའི་བུ་དང་། ཟླ་བ་དང་། ཉི་མ་དང་། རྣམ་ཐོས་ཀྱི་བུ་དང་། ཆུ་ལྷ་དང་། ནོར་ཅན་གྱི་བུ་དང་། ཐ་སྐར་གྱི་བུ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། སྲིན་པོ་དང་། འབྱུང་པོ་དང་། གྲུལ་བུམ་དང་། ཡི་དགས་དང་། འཁོར་དང་། ཚོགས་དང་། མཚུན་དང་། ཤ་ཟ་དང་། ལྷའི་དྲང་སྲོང་དང་། རྒྱལ་པོའི་དྲང་སྲོང་དང་། ཚངས་པའི་དྲང་སྲོང་དག་ལ་ཕྱག་འཚལ་ཞིང་དེ་དག་ལ་སྙིང་པོར་འདུ་ཤེས་སོ།
en: Considering themselves pure, they take refuge in and pay homage to beings that they believe to be essential, such as Brahmā, Indra, Rudra, Viṣṇu, Devī, Kumāra, Mātṛ, Katyāyanī, Candra, Āditya, Vaiśravaṇa, Varuṇa, the Vāsus, the Aśvins, nāgas, yakṣas, gandharvas, demigods, garuḍas, kinnaras, mahoragas, rākṣasas, bhūtas, kumbhāṇḍas, pretas, gaṇas, ancestors, piśācas, devarṣis, rājarṣis, and brahmarṣis.

source: །ས་དང་། ཆུ་དང་། མེ་དང་། རླུང་དང་། ནམ་མཁའ་ལ་ཡང་རྟེན། རི་དང་། རི་སུལ་དང་། ཀླུང་དང་། ཆུ་མིག་དང་། མཚོ་དང་། མཚེའུ་དང་། རྫིང་དང་། རྒྱ་མཚོ་དང་། ལྟེང་ཀ་དང་། ཁྲོན་པ་དང་། རྫིང་བུ་དང་། ཤིང་དང་། ཤིང་གེལ་པ་དང་། འཁྲི་ཤིང་དང་། རྩྭ་དང་། སྡོང་དུམ་དང་། ལྷས་དང་། དུར་ཁྲོད་དང་། བཞི་མདོ་དང་། སུམ་མདོ་དང་། སྲང་དག་ལ་ཡང་རྟེན་ཏོ།
en: “They also take refuge in the elements, such as earth, water, fire, wind, and space. Likewise they resort for refuge in mountains, rivers, sources of rivers, lakes, ponds, pools, oceans, reservoirs, lotus ponds, and wells; trees, bushes, vines, grass, tree trunks; cow pens, cemeteries, crossroads where four roads meet, and markets.

source: །ཁང་པ་དང་། ཀ་བ་དང་། རྡོ་བ་དང་། ཐོ་བ་དང་། རལ་གྲི་དང་། གཞུ་དང་། དགྲ་སྟ་དང་། མདའ་དང་། མདུང་ཐུང་དང་། རྩེ་གསུམ་པ་དག་ལའང་ཕྱག་འཚལ་ལོ།
en: They pay homage to houses, pillars, and rocks; clubs, swords, bows, axes, arrows, spears, and tridents.

source: །ཞོ་དང་། མར་དང་། ཡུངས་ཀར་དང་། ནས་དང་། ཤིང་བལ་གྱི་ཕྲེང་བ་དང་། རྩྭ་དཱུར་བ་དང་། ནོར་བུ་དང་། གསེར་དང་། དངུལ་ལ་སོགས་པ་ལ་བཀྲ་ཤིས་པར་འཛིན་ཏེ།
en: They also believe that yogurt, butter, mustard seeds, barley, magic strings, dūrvā grass, jewels, gold, silver, and other such items are auspicious.

source: གཞན་མུ་སྟེགས་ཅན་འདི་དག་འཁོར་བས་འཇིགས་སྐྲག་ནས་རྣམ་པ་དེ་ལྟ་བུ་དག་བྱེད་ཅིང་རྟེན་ཏོ།
en: “This is what these extremists rely on because of their fear of cyclic existence.

source: །འདི་ན་ཁ་ཅིག་བདག་ཅག་གི་མཐོ་རིས་དང་ཐར་པ་ཡང་འདི་ལྟ་བུ་དག་ལས་འགྲུབ་པོ་སྙམ་དུ་སེམས་ཏེ།
en: In doing so, some of them think, ‘Because of these methods, in the afterlife we shall find heaven and final emancipation.’ In this way they go astray on errant paths.

source: དེ་ལྟར་ལོག་པའི་ལམ་དུ་སོང་བས་སྐྱབས་མ་ཡིན་པ་ལ་སྐྱབས་སུ་འདུ་ཤེས་ཤིང་།
en: They seek refuge in that which cannot offer protection.

source: བཀྲ་ཤིས་མ་ཡིན་པ་ལ་བཀྲ་ཤིས་པར་འདུ་ཤེས་ལ།
en: They take as auspicious that which is not auspicious.

source: དག་པ་མ་ཡིན་པ་ལ་དག་པར་སེམས་ཀྱིས་བདག་གིས་ཅི་ནས་ཀྱང་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཚར་བཅད་པར་འགྱུར་བ་དང་། སེམས་ཅན་ལས་དང་བྱ་བ་ཆུད་ཟོས་པ་རྣམས་ཀྱི་ལས་དང་བྱ་བ་ཆུད་མི་ཟ་བ་བསྟན་པར་བྱ་བ་དང་། གཟུགས་ན་སྤྱོད་པའི་ལྷ་བསམ་གཏན་སྤྱོད་ཡུལ་པ་རྣམས་ལ་བསམ་གཏན་གྱི་ཁྱད་པར་བསྟན་པས་འདུན་པར་བྱེད་པ་དེ་ལྟ་བུའི་བརྟུལ་ཞུགས་དང་། དཀའ་ཐུབ་ཀྱི་ཁྱད་པར་བརྩམ་མོ་སྙམ་མོ།
en: They take as pure that which is not pure. “However, if I now attain mastery in the prescribed practices and austerities, all the opposing views will become suppressed. I will then demonstrate to these people, who disregard karmic actions, the inescapability of the fruits of actions. And as for the gods in the realms of meditative concentration and form, if I can demonstrate a superior meditative concentration, they will become interested.”

source: །དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔས་དེ་སྙམ་དུ་བསམས་ནས་ལོ་དྲུག་ཏུ་བརྟུལ་ཞུགས་དང་དཀའ་ཐུབ་ཤིན་ཏུ་དྲག་པོ་ཤིན་ཏུ་སྤྱད་པར་དཀའ་བ། ཤིན་ཏུ་བྱ་བར་དཀའ་བའི་དཀའ་བ་སྤྱད་པར་བརྩམས་སོ། །
en: Monks, following up on these thoughts, the Bodhisattva now began a six-year period of extremely fierce prescribed practices and hardships that were intensely difficult, the hardest of all difficult practices.

source: ཅིའི་ཕྱིར་དཀའ་བ་སྤྱད་པ་ཞེས་བྱ་ཞེ་ན། དེ་ནི་སྤྱད་པར་དཀའ་བ་སྟེ། དེ་བས་ན་དཀའ་བ་སྤྱད་པ་ཞེས་བྱ་སྟེ།
en: The reason for calling this difficult practice is because it is excruciatingly difficult, and therefore it is described in such terms.

source: བྱང་ཆུབ་སེམས་དཔའ་སྲིད་པ་ཐ་མ་པ་གང་བསམ་གཏན་མཁའ་ཁྱབ་ལ་སྙོམས་པར་ཞུགས་པ་མ་གཏོགས་པར་སེམས་ཅན་གྱི་རིས་ན་མིའམ་མི་མ་ཡིན་པ་སུས་ཀྱང་དཀའ་བ་སྤྱད་པ་དེ་ལྟ་བུ་སྤྱོད་པར་ནུས་པ་མེད་དོ།
en: Except for a bodhisattva who has reached his last existence and rests in equanimity in all-pervasive absorption, there is no one, human or nonhuman, who is capable of undergoing such hardships.

source: །ཅིའི་ཕྱིར་མཁའ་ཁྱབ་ཅེས་བྱ་ཞེ་ན། དེ་དང་པོ་ཉིད་དུ་བསམ་གཏན་བཞི་པ་ལ་སྙོམས་པར་འཇུག་པའི་ཚེ། དབུགས་ཕྱི་ནང་དུ་རྒྱུ་བ་ཉེ་བར་འགོག་ཀུན་ཏུ་འགོག་སྟེ། བསམ་གཏན་དེ་ནི་རྟོག་པ་མེད། རྣམ་པར་རྟོག་པ་མེད། གཡོ་བ་མེད། སེམས་པ་མེད། འགྱུར་བ་མེད་ཅིང་ཐམས་ཅད་དུ་རྗེས་སུ་སོང་བ། ཐམས་ཅད་ལ་མི་རྟེན་པ་སྟེ། བསམ་གཏན་དེ་ལ་སྔོན་སློབ་པའམ། མི་སློབ་པའམ། རང་སངས་རྒྱས་སམ། སྤྱོད་པ་ལ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སུས་ཀྱང་སྙོམས་པར་མ་ཞུགས་སོ།
en: This absorption is called all-pervasive because as the Bodhisattva rested in equanimity in the fourth absorption, from the very beginning all movements of the breath slowed down and ceased, and the absorption was nonconceptual. There was no thought, no movement, no conceptual mind, and no change, yet it was all-pervading and not dependent on anything. Previously no student, master, solitary buddha, or bodhisattva who had taken up such conduct had ever entered this absorption.

source: །མཁའ་ཞེས་བྱ་བ་ནི་ནམ་མཁའ་སྟེ། ཁྱབ་པར་མི་བྱེད་པ་བྱེད་པ་མེད་པ། རྣམ་པར་མི་འཐོར་བ་སྟེ། དེས་ཐམས་ཅད་ཁྱབ་པར་བྱེད་པས་ན། བསམ་གཏན་དེ་ནམ་མཁའ་དང་མཉམ་པ་སྟེ། དེ་བས་ན་མཁའ་ཁྱབ་ཅེས་བྱའོ།
en: This absorption is likened to space, because like space—which is motionless, uncaused, and changeless—there is nowhere it cannot reach. In that way it is similar to space, and therefore it is described as such.

source: །དགེ་སློང་དག་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་པ་རྣམས་ལ་ངོ་མཚར་ཡང་དག་པར་བསྟན་པར་བྱ་བ་དང་། མུ་སྟེགས་ཅན་རྣམས་ཀྱི་རྒྱགས་པ་གཞིལ་བ་དང་། ཕས་ཀྱི་རྒོལ་བ་རྣམས་ཚར་གཅོད་པ་དང་། ལྷ་རྣམས་འདུན་པར་བྱ་བ་དང་། སེམས་ཅན་ཆད་པ་དང་། རྟག་པར་སྨྲ་བ། ལས་དང་བྱ་བ་ཆུད་ཟོས་པ་རྣམས་ལས་དང་བྱ་བ་ལ་གཟུད་པ་དང་། བསོད་ནམས་ཀྱི་འབྲས་བུ་བརྗོད་པ་དང་། ཡེ་ཤེས་ཀྱི་འབྲས་བུ་ཡང་དག་པར་བསྟན་པ་དང་། བསམ་གཏན་གྱི་ཡན་ལག་རྣམ་པར་དབྱེ་བ་དང་། ལུས་ཀྱི་སྟོབས་དང་། མཐུ་ཡང་དག་པར་བསྟན་པ་དང་། སེམས་ཀྱི་དཔའ་བ་ཡང་དག་པར་བསྐྱེད་པའི་ཕྱིར། བྱི་དོར་མ་བྱས་པའི་ས་ཐ་མལ་པ་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འདུག་གོ། །འདུག་ནས་རང་གི་ལུས་སེམས་ཀྱིས་ཚར་བཅད་ཅིང་གཟིར་ཏོ།
en: Monks, in this way the Bodhisattva displayed true wonders to the worldly ones. He did so in order to shatter the proud satisfaction of extreme practitioners, to vanquish the opponents’ attacks, to attract the gods, and to correct nihilists and eternalists, who disregard karmic action. He also did so in order to declare the results of merit, to teach the results of wisdom, to distinguish the levels of concentration, to demonstrate the power and strength of the body, and to develop bravery of mind. For these reasons the Bodhisattva sat down on the rugged earth, crossed his legs, and began to punish and torment his body through his mental resolve.

source: །དགེ་སློང་དག་དེ་ནས་ང་དགུན་གྱི་ཚེས་བརྒྱད་པའི་ནུབ་མོ་དེ་ལྟར་ལུས་ཚར་བཅད་ཅིང་གཟིར་བས།
en: Monks, for eight winter nights I punished and tormented my body. Sweat ran from my armpits and from my forehead.

source: མཆན་ཁུང་ནས་ཀྱང་རྔུལ་བྱུང་སྟེ་ཟགས། དཔྲལ་བ་ནས་ཀྱང་རྔུལ་བྱུང་སྟེ་ཟགས་ནས་ས་ལ་ལྷུང་སྟེ་ཟིལ་པར་ཆགས་ནས་དྲོ་ཞིང་རླངས་པ་བྱུང་ངོ་།
en: As the sweat fell on the ground, the drops turned into hoarfrost, heated up, and evaporated.

source: །འདི་ལྟ་སྟེ་དཔེར་ན་སྐྱེས་བུ་སྟོབས་དང་ལྡན་པས་སྐྱེས་བུ་ཤིན་ཏུ་ཉམ་ཆུང་བ་ཞིག་མགྲིན་པ་ནས་བཟུང་སྟེ་བཙིར་བ་དེ་བཞིན་དུ་དགེ་སློང་དག་ལུས་འདི་སེམས་ཀྱིས་ཚར་བཅད་ཅིང་གཟིར་ན་མཆན་ཁུང་ནས་ཀྱང་རྔུལ་བྱུང་ཞིང་ཟགས། དཔྲལ་བ་ནས་ཀྱང་རྔུལ་བྱུང་ཞིང་ཟགས་ནས་ས་ལ་ལྷུང་སྟེ། ཟིལ་པར་ཆགས་ནས་དྲོ་ཞིང་རླངས་པ་བྱུང་ངོ་།
en: It was just like a strong man who grabs a very feeble person by the neck and strangles him. Such was the manner, monks, in which my mind brought punishment and torment on my body. Sweat ran from my armpits and from my forehead and, as the sweat fell on the ground, the drops turned into hoarfrost, then grew hot, and evaporated.

source: །དགེ་སློང་དག་དེ་ནས་ངས་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་གིས་བསམ་གཏན་མཁའ་ཁྱབ་ལ་བསམ་གཏན་དུ་བྱའོ་སྙམ་ནས། དགེ་སློང་དག་དེ་ནས་ངས་བསམ་གཏན་མཁའ་ཁྱབ་ལ་བསམ་གཏན་དུ་བྱས་པ་དང་། ཁ་དང་སྣ་ནས་དབུགས་ཕྱི་ནང་དུ་རྒྱུ་བ་འགགས་པར་གྱུར་ཏེ། རྣ་བའི་བུ་ག་གཉིས་ནས་སྒྲ་དྲག་པོ་ཆེན་པོ་བྱུང་ངོ་། །
en: Monks, at that point I thought to myself, “I should now practice the all-pervading absorption.” And, monks, as I was practicing the all-pervading absorption, from my mouth and my nose all movement of breath ceased, and within the openings of my ears an immense sound was heard.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྦུད་པ་བུས་པའི་ཚེ་སྒྲ་དྲག་པོ་དང་། སྒྲ་ཆེན་པོ་བྱུང་བ་དེ་བཞིན་དུ་དགེ་སློང་དག་ཁ་དང་སྣ་ནས་དབུགས་ཕྱི་ནང་དུ་རྒྱུ་བ་འགགས་པར་གྱུར་པ་དང་། རྣ་བའི་བུ་ག་གཉིས་ནས་སྒྲ་དྲག་པོ་དང་། སྒྲ་ཆེན་པོ་བྱུང་ངོ་།
en: The sound was as loud and intense as when a blacksmith’s bellows is being squeezed. Monks, all the while there was no movement of my breath through my mouth and nose, there was this intense, loud noise in my ears.

source: །དགེ་སློང་དག་དེ་ནས་ངས་འདི་སྙམ་དུ་བསམས་ཏེ་ཡང་བདག་གིས་བསམ་གཏན་མཁའ་ཁྱབ་ལ་བསམ་གཏན་དུ་བྱའོ་སྙམ་པ་དང་། དེ་ནས་ངའི་ཁ་དང་སྣ་དང་རྣ་བ་འགགས་པར་གྱུར་ཏོ། །དེ་དག་འགགས་པ་དང་། རླུང་གོང་དུ་མགོའི་ཐོད་པ་ལ་གནོད་པར་གྱུར་ཏོ།
en: Monks, I then continued to think, “I should practice the all-pervading absorption.” Since my mouth, nose, and ears were blocked, the breath went up into my skull.

source: །དགེ་སློང་དག་འདི་ལྟ་སྟེ་དཔེར་ན་སྐྱེས་བུ་ཞིག་གིས་མདུང་ཐུང་རྟུལ་པོས་མགོའི་ཐོད་པ་ལ་བཏབ་པ་དེ་བཞིན་དུ་དགེ་སློང་དག་ཁ་དང་སྣ་དང་རྣ་བའི་དབུགས་ཕྱི་ནང་དུ་རྒྱུ་བ་འགགས་པ་དང་གོང་དུ་མགོའི་ཐོད་པ་ལ་གནོད་པར་གྱུར་ཏོ།
en: Monks, it felt as if someone was striking my skull with a sharp spear. Monks, in that way, as my mouth, nose, and ears were blocked, my in-breaths and out-breaths were pushing up and hitting my skull.

source: །དེར་ལྷའི་བུ་གཅིག་གིས་བྱང་ཆུབ་སེམས་དཔའ་ན་བ་དེ་མཐོང་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Some gods noticed the suffering of the Bodhisattva and remarked,

source: ཀྱེ་མའོ་ཀྱི་ཧུད་གཞོན་ནུ་དོན་གྲུབ་འདི་འཆི་བའི་དུས་བྱས་སོ།
en: “Oh no! It seems the young Siddhārtha is dying!”

source: །གཞན་ཞིག་གིས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The others remarked, “No, he’s not dying.

source: །འདི་འཆི་བའི་དུས་བྱས་པ་མ་ཡིན་གྱི་དགྲ་བཅོམ་པ་བསམ་གཏན་ལ་གནས་པ་རྣམས་ཀྱི་ཚུལ་ནི་དེ་ལྟ་བུའོ་ཞེས་སྨྲས་ནས།
en: This is simply how worthy ones abide in absorption.”

source: །མི་ཡི་དབང་པོ་ཤཱཀྱའི་སྲས་པོ་འདི།
en: “May this son of the Śākya kings,

source: །བརྣག་པ་མ་རྫོགས་དོན་ཀྱང་མ་མཛད་ཅིང་། །འཇིག་རྟེན་གསུམ་པོ་སྡུག་བསྔལ་མགོན་མེད་པར། །མཛད་ནས་དགོན་འདིར་གྲོངས་པར་མི་འགྱུར་གྲང་།
en: Who has not fulfilled his aim in the forest here, Not pass away without fulfilling his intention, And thus leave this triple world suffering and without a defender.

source: །ཀྱི་ཧུད་སེམས་ཅན་སྙིང་པོ་ཐུགས་དམ་བརྟན།
en: “Oh no! You are the essential being and your commitment is strong.

source: །མགོན་པོས་སྔན་ཆད་བདག་ཅག་དགའ་ལྡན་དུ།
en: Protector, previously in the Heaven of Joy you invited us

source: །དམ་ཆོས་མཆོད་སྦྱིན་ལ་ནི་འགྲོན་དུ་བོས།
en: To hear the gift of the sacred Dharma,

source: །སེམས་ཅན་དག་ཁྱོད་དམ་བཅས་དེ་ག་རེ།
en: But now where is your resolve, O Pure Being?”

source: །དེ་ནས་ལྷ་དེ་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷའི་ནང་དུ་སོང་སྟེ་ལྷ་མོ་སྒྱུ་འཕྲུལ་ལ་གཞོན་ནུ་ནི་འཆི་བའི་དུས་བྱས་སོ་ཞེས་དོན་དེ་བརྗོད་དོ།
en: These gods then went to the gods in the Heaven of the Thirty-Three and told Māyādevī, “It seems that the young prince is about to pass away.”
